{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "cell": {},
  "dim": 312,
  "dropout": 0.1,
  "dtype": "float32",
  "emb_size": 312,
  "hidden_act": "gelu",
  "hidden_dim": 3072,
  "hidden_dropout_prob": 0.1,
  "initializer_range": 0.02,
  "intermediate_size": 1200,
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 4,
  "output_attentions": true,
  "pad_token_id": 0,
  "pre_trained": "",
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "structure": [],
  "transformers_version": "4.57.1",
  "type_vocab_size": 2,
  "vocab_size": 30522
}
